{"id":9657,"date":"2022-01-19T10:57:00","date_gmt":"2022-01-19T00:57:00","guid":{"rendered":"https:\/\/varautomotive.com.au\/?p=9657"},"modified":"2022-07-11T14:42:08","modified_gmt":"2022-07-11T04:42:08","slug":"the-importance-of-regular-car-repairs","status":"publish","type":"post","link":"https:\/\/varautomotive.com.au\/the-importance-of-regular-car-repairs\/","title":{"rendered":"The Importance of Regular Car Repairs"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"9657\" class=\"elementor elementor-9657\" data-elementor-post-type=\"post\">\n\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-5d1ff9ca elementor-section-boxed elementor-section-height-default elementor-section-height-default qodef-elementor-content-no qodef-elementor-stretch-row-no qodef-elementor-overlay-no\" data-id=\"5d1ff9ca\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-22c36f8b\" data-id=\"22c36f8b\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-1698697e elementor-widget elementor-widget-text-editor\" data-id=\"1698697e\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t\t\n<p>As we should all know the importance of a regular visit to the doctors if for no other reason than just a quick check up to ensure our bodies are working as they should and everything is in order, the same can be said for our car. Having a regular service and car repairs is oftentimes overlooked and forgotten for a number of reasons such as; time, the thought of the cost of a service and possible auto repairs in Sydney, convenience, and just thinking that it is not that important and can wait.<\/p>\n\n\n\n<p>The simple truth is that the longer a service or inspection is put off, the more likely it is that minor issues that could be easily fixed turn into bigger and more expensive car repairs that can affect the safety of your car or leave you stuck on the side of the road. Replacing a radiator at the first sign of a leak from a crack is much cheaper and convenient than having this problem manifest and the radiator overheat leaving you stuck on the side of the road and overheated yourself!<\/p>\n\n\n\n<p>Every make and model of vehicle is different and as such will have different maintenance requirements and schedules which should be followed to ensure optimum mechanical performance in order to ensure manufacturers warranties are not voided. Regardless of vehicle make, model, and manufacturer recommendations, it is universally accepted that at a minimum, a car should be serviced every 6 months or 10,000 kilometres (whichever comes first), though this may be sooner depending on the type of driving that you do.<\/p>\n\n\n\n<p>At VAR Automotive, we believe that there are a number of benefits of a regular service, and car repairs will keep your car in tip top shape and the experience of a service is neither as expensive or inconvenient as many people believe. We also believe that there are a number of basic preventative maintenance tasks that can be undertaken between auto repair services to ensure optimum performance for your car.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of a Regular Service<\/h2>\n\n\n\n<p>There are a number of benefits of a regular service, these include;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>New Car Warranty<\/strong><\/h3>\n\n\n\n<p>All new cars will come with a new car warranty, and more often than not part of the conditions of keeping this warranty is following the service and maintenance schedule recommended by the manufacturer (this is crucial in the event you need to make a claim for repairs under warranty). At VAR Automotive, luxury car auto repair shop, we are licensed to carry out independent logbook servicing on almost all makes and models of car, this will not only protect your new car warranty, however is cheaper than expensive dealership servicing.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Early Diagnosis<\/strong><\/h3>\n\n\n\n<p>Just like with a regular trip to the doctor and a routine blood test, a regular inspection and auto repair service of your vehicle can potentially find and diagnose small mechanical issues that can be fixed before becoming much larger issues that can affect other parts of your vehicle and potentially leave you stranded on the side of the road.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Safety<\/strong><\/h3>\n\n\n\n<p>During a regular inspection and auto repair service, your fully trained VAR technician will undertake a safety check and look for any damage or wear and tear to components that may cause safety problems. This includes inspecting, cleaning, and replacing brakes and brake components as needed as well as checking the tyres and wheel alignment.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lower Running Costs<\/strong><\/h3>\n\n\n\n<p>The sooner that any minor issues can be diagnosed and corrected this will stop bigger problems from occurring and ultimately will save on maintenance and running costs over the lifetime of your vehicle. Things such as replacing spark plugs before the end of their life can have a major impact on engine performance and reduce the strain on other components.&nbsp;<\/p>\n\n\n\n<p>A simple tip from us at VAR Automotive, is to always keep your fuel level at minimum of a quarter tank full, this way the fuel system will be taking in cleaner fuel that sits higher in the tank as opposed to the fuel at the bottom of the tank when near empty where any fuel sediment will be sitting towards the bottom of the tank (this will prevent constantly replacing fuel filters and is better for the engine).<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Maintain Vehicle Value<\/strong><\/h3>\n\n\n\n<p>There is a noticeable difference between the performance of a vehicle that has been well maintained and one that has not been, and the one that has been well maintained will always have a higher resale value than the one that has not. At VAR Automotive, not only can we regularly maintain and service your vehicle ensuring optimum performance, when it comes time to upgrade, we can help you get the best possible resale value for your previously loved pride and joy with our buy and sell.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Preventative Maintenance<\/h2>\n\n\n\n<p>There are a number of minor, preventative maintenance tasks that can be undertaken between services to ensure the optimal running of your car, less wear and tear and increasing the longevity of components thus ensuring vehicle safety is maintained and can save on car repairs in The Eastern Suburbs for your next service, these include;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Tyres and Tyre Pressure<\/strong><\/h3>\n\n\n\n<p>As we have covered in a previous blog post about the importance of a regular tyre inspection and service, to ensure optimal tyre performance, vehicle safety and longevity of the tyres, they should be checked or any signs of damage on a regular basis. It is also important to ensure that the tyre pressure is regularly checked and adjusted based on weight variances (for example tyre pressure will need to be adjusted for towing of trailers and caravans etc).<\/p>\n\n\n\n<p>We recommend that tyre pressure is checked at a minimum every second time in which you fuel up, and where practical try and check the tyre pressure as close to home as possible when the tyres are cooler as the warmer they are the higher the tyre pressure reading will be and this may mean that the air pressure is not filled up to the correct level.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Engine Fluids<\/strong><\/h3>\n\n\n\n<p>Even with the sensors and warning indicators that modern cars have to sense and alert you of any low fluid levels, it is still good practice to give the fluid levels a good old fashioned look over once in a while (before any low level fluid indicators appear).&nbsp;<\/p>\n\n\n\n<p>Have a quick look at engine coolant levels, most cars today have a long life engine coolant and if the fluid is little on the low side this can be topped up with a little bit of water until the next service.<\/p>\n\n\n\n<p>Check the engine oil level and if this is on the low side, top this up with a small amount of the manufacturer&#8217;s recommended oil, we also would recommend adding a small amount of new oil every few months regardless of the level being low, as this will freshen up the older oil that is going into the engine.<\/p>\n\n\n\n<p>When checking engine oil and fluid levels, it is important to only attempt this before driving and when the engine is cold, as firstly, when the engine is warm these fluids expand and will show a higher reading, and secondly and more importantly, for safety reasons and to prevent burns as the engine and engine components can become very hot very quickly.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wiper Blades and Fluid Levels<\/strong><\/h3>\n\n\n\n<p>The wiper blades are an important safety feature on any vehicle and often they are overlooked. To ensure optimal wiper performance and longevity we recommend simply wiping over them with a damp cloth when you get fuel. We would also suggest giving the windscreen a once over with a chamois at the same time as keeping your windscreen clean will mean less work and resistance for the wipers.<\/p>\n\n\n\n<p>Wiper fluid should be checked occasionally to ensure that it is not low, if this on the lower side this can be simply topped up with water until your next service, at the same time as checking this we would suggest activating the water jets for the wipers to ensure that these are working and there are no blockages in them.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lights<\/strong><\/h3>\n\n\n\n<p>Every few weeks it is a good idea to check that all the external safety lights on your vehicle are in working order. This is extremely important for your own safety and the safety of other road users, and can also potentially save a fine that is not needed with many of the fines in NSW for vehicle lights not working being $116.<\/p>\n\n\n\n<p>When checking external lights, have someone as an observer to help and if possible, do this in darker light. Check the indicator lights on the front, back and mirror, check the headlights (both low beam and high beam), check the fog lights, and check the brake lights.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Urgent Car Repairs<\/h2>\n\n\n\n<p>There are some things that are so important to the efficient running of your vehicle, performance and most importantly safety that they simply cannot be overlooked until the next service and need immediate attention, these include;&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Engine\/ Dashboard Lights<\/strong><\/h3>\n\n\n\n<p>The lights on the dashboard are there for a reason and are oftentimes the first indicator that something is wrong. If a dashboard light comes on whether this be an engine light, a transmission light or any other light, this is something that needs to be looked into ASAP. Contact us at VAR Automotive and we will look into the issue and rectify the problem for you.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Squeaking Brakes<\/strong><\/h3>\n\n\n\n<p>If you can hear that ghastly squeaking sound whenever you put your foot down on the brake pedal, this is a major sign that your brakes are suffering and need to be looked at immediately. Squeaking brakes are not just annoying on the ears, however it also means that should you need to brake heavily in an emergency situation you will be unable to stop as quickly or as safely as you could. For a brake inspection or service, contact us today.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Battery<\/strong><\/h3>\n\n\n\n<p>If the lights on your dashboard don’t seem as bright as they should be or they dim when starting your vehicle, this is a sign that your battery is nearing the end of its life. Another sign of this is if your car is a bit sluggish when you go to turn the ignition. Having your battery inspected and replaced prior to it becoming flat, could be the difference between being stuck in a car park waiting for a mechanic or not enduring this frustration. If you suspect that your battery is near the end of its life, organise a battery inspection with us today.&nbsp;<\/p>\n\n\n\n<p>Conclusion<\/p>\n\n\n\n<p>A regular inspection and service doesn’t need to be overlooked leading to costly and easily preventable major repairs. Simply contact us at VAR Automotive and let us give your car the once over, best of all is that we can offer a convenient pick up and drop off service for all our customers within 10 kilometers of our prestige garage in Vaucluse.<\/p>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-ae23bc5 elementor-section-boxed elementor-section-height-default elementor-section-height-default qodef-elementor-content-no qodef-elementor-stretch-row-no qodef-elementor-overlay-no\" data-id=\"ae23bc5\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-70a908a\" data-id=\"70a908a\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-223883f elementor-widget__width-initial elementor-widget elementor-widget-zermatt_core_button\" data-id=\"223883f\" data-element_type=\"widget\" data-widget_type=\"zermatt_core_button.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<a class=\"qodef-shortcode qodef-m  qodef-button qodef-layout--filled  qodef-html--link qodef-text-hover\" href=\"tel:0293371136\" target=\"_self\"  style=\"padding: 66\">\n\t\t\t<span class=\"qodef-m-text-holder\">\n\t\t\t<span class=\"qodef-m-text\">CALL US<\/span>\n\t\t\t<span class=\"qodef-m-text\">CALL US<\/span>\n\t\t<\/span>\n\t<\/a>\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-bc0487d elementor-widget__width-auto elementor-widget-mobile__width-initial elementor-widget elementor-widget-zermatt_core_button\" data-id=\"bc0487d\" data-element_type=\"widget\" data-widget_type=\"zermatt_core_button.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<a class=\"qodef-shortcode qodef-m  qodef-button qodef-layout--filled  qodef-html--link qodef-text-hover\" href=\"https:\/\/varautomotive.com.au\/sydney-car-service-booking\/\" target=\"_self\"  >\n\t\t\t<span class=\"qodef-m-text-holder\">\n\t\t\t<span class=\"qodef-m-text\">BOOK AN INSPECTION<\/span>\n\t\t\t<span class=\"qodef-m-text\">BOOK AN INSPECTION<\/span>\n\t\t<\/span>\n\t<\/a>\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>As we should all know the importance of a regular visit to the doctors if for no other reason than just a quick check up to ensure our bodies are working as they should and everything is in order, the same can be said for our car. Having a regular service and car repairs is [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":9658,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[90],"tags":[],"class_list":["post-9657","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-car-service"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Car Repair Services Eastern Suburbs - VAR Automotive<\/title>\n<meta name=\"description\" content=\"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Car Repair Services Eastern Suburbs - VAR Automotive\" \/>\n<meta property=\"og:description\" content=\"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information\" \/>\n<meta property=\"og:url\" content=\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\" \/>\n<meta property=\"og:site_name\" content=\"VAR\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/VaucluseAuto\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-01-19T00:57:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-07-11T04:42:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1331\" \/>\n\t<meta property=\"og:image:height\" content=\"749\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"VAR Automotive\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"VAR Automotive\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":[\"Article\",\"BlogPosting\"],\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#article\",\"isPartOf\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\"},\"author\":{\"name\":\"VAR Automotive\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/f2e66329a58f8e014d2a2e053ce8ce9e\"},\"headline\":\"The Importance of Regular Car Repairs\",\"datePublished\":\"2022-01-19T00:57:00+00:00\",\"dateModified\":\"2022-07-11T04:42:08+00:00\",\"mainEntityOfPage\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\"},\"wordCount\":1843,\"publisher\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#organization\"},\"image\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg\",\"articleSection\":[\"Car Service\"],\"inLanguage\":\"en-AU\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\",\"url\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\",\"name\":\"Car Repair Services Eastern Suburbs - VAR Automotive\",\"isPartOf\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage\"},\"image\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg\",\"datePublished\":\"2022-01-19T00:57:00+00:00\",\"dateModified\":\"2022-07-11T04:42:08+00:00\",\"description\":\"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information\",\"breadcrumb\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#breadcrumb\"},\"inLanguage\":\"en-AU\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage\",\"url\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg\",\"contentUrl\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg\",\"width\":1331,\"height\":749,\"caption\":\"Car Repair Services The Eastern Suburbs\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"http:\/\/zjm.0be.myftpupload.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Importance of Regular Car Repairs\"}]},{\"@type\":\"WebSite\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#website\",\"url\":\"http:\/\/zjm.0be.myftpupload.com\/\",\"name\":\"VAR\",\"description\":\"Repairing, restoring, modifying, maintaining and servicing vehicles in the local community\",\"publisher\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"http:\/\/zjm.0be.myftpupload.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-AU\"},{\"@type\":\"Organization\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#organization\",\"name\":\"VAR Automotive\",\"url\":\"http:\/\/zjm.0be.myftpupload.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/04\/VAR_Automotive.jpeg\",\"contentUrl\":\"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/04\/VAR_Automotive.jpeg\",\"width\":512,\"height\":512,\"caption\":\"VAR Automotive\"},\"image\":{\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/VaucluseAuto\/\",\"https:\/\/www.instagram.com\/vaucluseauto\/\"]},{\"@type\":\"Person\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/f2e66329a58f8e014d2a2e053ce8ce9e\",\"name\":\"VAR Automotive\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/3f2dd4be00c1eaa1c6281b3656d96a97f1912455019851e11a29debf9c4782c4?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/3f2dd4be00c1eaa1c6281b3656d96a97f1912455019851e11a29debf9c4782c4?s=96&d=mm&r=g\",\"caption\":\"VAR Automotive\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Car Repair Services Eastern Suburbs - VAR Automotive","description":"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/","og_locale":"en_US","og_type":"article","og_title":"Car Repair Services Eastern Suburbs - VAR Automotive","og_description":"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information","og_url":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/","og_site_name":"VAR","article_publisher":"https:\/\/www.facebook.com\/VaucluseAuto\/","article_published_time":"2022-01-19T00:57:00+00:00","article_modified_time":"2022-07-11T04:42:08+00:00","og_image":[{"width":1331,"height":749,"url":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg","type":"image\/jpeg"}],"author":"VAR Automotive","twitter_card":"summary_large_image","twitter_misc":{"Written by":"VAR Automotive","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":["Article","BlogPosting"],"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#article","isPartOf":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/"},"author":{"name":"VAR Automotive","@id":"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/f2e66329a58f8e014d2a2e053ce8ce9e"},"headline":"The Importance of Regular Car Repairs","datePublished":"2022-01-19T00:57:00+00:00","dateModified":"2022-07-11T04:42:08+00:00","mainEntityOfPage":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/"},"wordCount":1843,"publisher":{"@id":"http:\/\/zjm.0be.myftpupload.com\/#organization"},"image":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage"},"thumbnailUrl":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg","articleSection":["Car Service"],"inLanguage":"en-AU"},{"@type":"WebPage","@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/","url":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/","name":"Car Repair Services Eastern Suburbs - VAR Automotive","isPartOf":{"@id":"http:\/\/zjm.0be.myftpupload.com\/#website"},"primaryImageOfPage":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage"},"image":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage"},"thumbnailUrl":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg","datePublished":"2022-01-19T00:57:00+00:00","dateModified":"2022-07-11T04:42:08+00:00","description":"Here are all the benefits of having a regular professional mechanic maintenance repairs. Contact VAR Automotive for more information","breadcrumb":{"@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#breadcrumb"},"inLanguage":"en-AU","potentialAction":[{"@type":"ReadAction","target":["http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/"]}]},{"@type":"ImageObject","inLanguage":"en-AU","@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#primaryimage","url":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg","contentUrl":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/05\/Car_Repair_Services_Sydney_Eastern_Suburbs_VAR_Automotive.jpeg","width":1331,"height":749,"caption":"Car Repair Services The Eastern Suburbs"},{"@type":"BreadcrumbList","@id":"http:\/\/zjm.0be.myftpupload.com\/the-importance-of-regular-car-repairs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"http:\/\/zjm.0be.myftpupload.com\/"},{"@type":"ListItem","position":2,"name":"The Importance of Regular Car Repairs"}]},{"@type":"WebSite","@id":"http:\/\/zjm.0be.myftpupload.com\/#website","url":"http:\/\/zjm.0be.myftpupload.com\/","name":"VAR","description":"Repairing, restoring, modifying, maintaining and servicing vehicles in the local community","publisher":{"@id":"http:\/\/zjm.0be.myftpupload.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"http:\/\/zjm.0be.myftpupload.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-AU"},{"@type":"Organization","@id":"http:\/\/zjm.0be.myftpupload.com\/#organization","name":"VAR Automotive","url":"http:\/\/zjm.0be.myftpupload.com\/","logo":{"@type":"ImageObject","inLanguage":"en-AU","@id":"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/logo\/image\/","url":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/04\/VAR_Automotive.jpeg","contentUrl":"https:\/\/varautomotive.com.au\/wp-content\/uploads\/2022\/04\/VAR_Automotive.jpeg","width":512,"height":512,"caption":"VAR Automotive"},"image":{"@id":"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/VaucluseAuto\/","https:\/\/www.instagram.com\/vaucluseauto\/"]},{"@type":"Person","@id":"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/f2e66329a58f8e014d2a2e053ce8ce9e","name":"VAR Automotive","image":{"@type":"ImageObject","inLanguage":"en-AU","@id":"http:\/\/zjm.0be.myftpupload.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/3f2dd4be00c1eaa1c6281b3656d96a97f1912455019851e11a29debf9c4782c4?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/3f2dd4be00c1eaa1c6281b3656d96a97f1912455019851e11a29debf9c4782c4?s=96&d=mm&r=g","caption":"VAR Automotive"}}]}},"_links":{"self":[{"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/posts\/9657","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/comments?post=9657"}],"version-history":[{"count":8,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/posts\/9657\/revisions"}],"predecessor-version":[{"id":12637,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/posts\/9657\/revisions\/12637"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/media\/9658"}],"wp:attachment":[{"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/media?parent=9657"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/categories?post=9657"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/varautomotive.com.au\/wp-json\/wp\/v2\/tags?post=9657"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}